app/Helpers/CIFunctions_helper.php

    function get_user()
    {
        if (CiAuth::check()) {
            $user  = new User();
            return $user->asObject()->where('id', CIauth::id())->first();
---
SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1