app/Controllers/AdminController.php

    public function pageSiswa()
    {
        $kelas = new \App\Models\Kelas();

        return view('backend/pages/pageSiswa', ['pageTitle' => 'Data Siswa', 'kelas' => $kelas->asObject()->findAll()]);
---
SELECT *
FROM `kelas`


            $data = $this->request->getPost();
            $siswaModel = new Siswa();
            $siswaModel->insert($data);
---
INSERT INTO `siswa` (`nama`, `jk`, `nisn`, `tempat_lahir`, `tanggal_lahir`, `nik`, `agama`, `alamat`, `rombel_saat_ini`) VALUES ('Siswa 3', 'L', '111111', 'Surabaya', '2025-05-15', '7503154309960003', 'Islam', 'Toko, Jalan Sam Ratulangi, Batu Kota, Tanjung Batu, Manado, Sulawesi Utara, Sulawesi, 95113, Indonesia', '3')

    public function datatablesSiswa()
    {
        $table = 'siswa';
        $primaryKey = 'id';

        $columns = [
            ['db' => 'id', 'dt' => 0],
            ['db' => 'nama', 'dt' => 1],
            [
                'db' => 'jk', 'dt' => 2,
                'formatter' => function ($d, $row) {
                    return $d == 'P' ? 'Perempuan' : 'Laki-Laki';
                }
            ],
            ['db' => 'nisn', 'dt' => 3],
            [
                'db' => 'rombel_saat_ini',
                'dt' => 4,
                'formatter' => function ($d, $row) {
                    $kelas = new \App\Models\Kelas();
                    $datakelas =  $kelas->asObject()->find($d);
---
SELECT *
FROM `kelas`
WHERE `kelas`.`id` = '1'

    public function pageKelas()
    {
        $guru = new Guru();

        return view('backend/pages/pageKelas', ['pageTitle' => 'Data Kelas', 'guru' => $guru->asObject()->findAll()]);
---
SELECT *
FROM `guru`

    public function datatablesKelas()
    {
        $table = 'kelas';
        $primaryKey = 'id';

        $columns = [
            [
                'db' => 'id',
                'dt' => 0,

            ],
            ['db' => 'nama_kelas', 'dt' => 1],
            [
                'db' => 'wali_kelas',
                'dt' => 2,
                'formatter' => function ($d, $row) {
                    $guru = new Guru();
                    $dataGuru = $guru->asObject()->find($d);
                    return $dataGuru->nama;
                }
            ],
            [
                'db' => 'id',
                'dt' => 3,
                'formatter' => function ($d, $row) {
                    $siswa = new Siswa();
                    $jumlah_siswa = count($siswa->where('rombel_saat_ini', $d)->findAll());
---
SELECT *
FROM `guru`
WHERE `guru`.`id` = 5
SELECT *
FROM `siswa`
WHERE `rombel_saat_ini` = 1